GopalSaraf/Practicals/PSDL/include/proc/pic16f1787.inc
// Register: ODCONA
#define ODCONA ODCONA
ODCONA                                   equ 028Ch
// bitfield definitions
ODCONA_ODCONA0_POSN                      equ 0000h
ODCONA_ODCONA0_POSITION                  equ 0000h
ODCONA_ODCONA0_SIZE                      equ 0001h
ODCONA_ODCONA0_LENGTH                    equ 0001h
ODCONA_ODCONA0_MASK                      equ 0001h
ODCONA_ODCONA1_POSN                      equ 0001h
ODCONA_ODCONA1_POSITION                  equ 0001h
ODCONA_ODCONA1_SIZE                      equ 0001h
ODCONA_ODCONA1_LENGTH                    equ 0001h
ODCONA_ODCONA1_MASK                      equ 0002h
ODCONA_ODCONA2_POSN                      equ 0002h
ODCONA_ODCONA2_POSITION                  equ 0002h
ODCONA_ODCONA2_SIZE                      equ 0001h
ODCONA_ODCONA2_LENGTH                    equ 0001h
ODCONA_ODCONA2_MASK                      equ 0004h
ODCONA_ODCONA3_POSN                      equ 0003h
ODCONA_ODCONA3_POSITION                  equ 0003h
ODCONA_ODCONA3_SIZE                      equ 0001h
ODCONA_ODCONA3_LENGTH                    equ 0001h
ODCONA_ODCONA3_MASK                      equ 0008h
ODCONA_ODCONA4_POSN                      equ 0004h
ODCONA_ODCONA4_POSITION                  equ 0004h
ODCONA_ODCONA4_SIZE                      equ 0001h
ODCONA_ODCONA4_LENGTH                    equ 0001h
ODCONA_ODCONA4_MASK                      equ 0010h
ODCONA_ODCONA5_POSN                      equ 0005h
ODCONA_ODCONA5_POSITION                  equ 0005h
ODCONA_ODCONA5_SIZE                      equ 0001h
ODCONA_ODCONA5_LENGTH                    equ 0001h
ODCONA_ODCONA5_MASK                      equ 0020h
ODCONA_ODCONA6_POSN                      equ 0006h
ODCONA_ODCONA6_POSITION                  equ 0006h
ODCONA_ODCONA6_SIZE                      equ 0001h
ODCONA_ODCONA6_LENGTH                    equ 0001h
ODCONA_ODCONA6_MASK                      equ 0040h
ODCONA_ODCONA7_POSN                      equ 0007h
ODCONA_ODCONA7_POSITION                  equ 0007h
ODCONA_ODCONA7_SIZE                      equ 0001h
ODCONA_ODCONA7_LENGTH                    equ 0001h
ODCONA_ODCONA7_MASK                      equ 0080h
ODCONA_ODCONA_POSN                       equ 0000h
ODCONA_ODCONA_POSITION                   equ 0000h
ODCONA_ODCONA_SIZE                       equ 0008h
ODCONA_ODCONA_LENGTH                     equ 0008h
ODCONA_ODCONA_MASK                       equ 00FFh

// Register: ODCONB
#define ODCONB ODCONB
ODCONB                                   equ 028Dh
// bitfield definitions
ODCONB_ODCONB0_POSN                      equ 0000h
ODCONB_ODCONB0_POSITION                  equ 0000h
ODCONB_ODCONB0_SIZE                      equ 0001h
ODCONB_ODCONB0_LENGTH                    equ 0001h
ODCONB_ODCONB0_MASK                      equ 0001h
ODCONB_ODCONB1_POSN                      equ 0001h
ODCONB_ODCONB1_POSITION                  equ 0001h
ODCONB_ODCONB1_SIZE                      equ 0001h
ODCONB_ODCONB1_LENGTH                    equ 0001h
ODCONB_ODCONB1_MASK                      equ 0002h
ODCONB_ODCONB2_POSN                      equ 0002h
ODCONB_ODCONB2_POSITION                  equ 0002h
ODCONB_ODCONB2_SIZE                      equ 0001h
ODCONB_ODCONB2_LENGTH                    equ 0001h
ODCONB_ODCONB2_MASK                      equ 0004h
ODCONB_ODCONB3_POSN                      equ 0003h
ODCONB_ODCONB3_POSITION                  equ 0003h
ODCONB_ODCONB3_SIZE                      equ 0001h
ODCONB_ODCONB3_LENGTH                    equ 0001h
ODCONB_ODCONB3_MASK                      equ 0008h
ODCONB_ODCONB4_POSN                      equ 0004h
ODCONB_ODCONB4_POSITION                  equ 0004h
ODCONB_ODCONB4_SIZE                      equ 0001h
ODCONB_ODCONB4_LENGTH                    equ 0001h
ODCONB_ODCONB4_MASK                      equ 0010h
ODCONB_ODCONB5_POSN                      equ 0005h
ODCONB_ODCONB5_POSITION                  equ 0005h
ODCONB_ODCONB5_SIZE                      equ 0001h
ODCONB_ODCONB5_LENGTH                    equ 0001h
ODCONB_ODCONB5_MASK                      equ 0020h
ODCONB_ODCONB6_POSN                      equ 0006h
ODCONB_ODCONB6_POSITION                  equ 0006h
ODCONB_ODCONB6_SIZE                      equ 0001h
ODCONB_ODCONB6_LENGTH                    equ 0001h
ODCONB_ODCONB6_MASK                      equ 0040h
ODCONB_ODCONB7_POSN                      equ 0007h
ODCONB_ODCONB7_POSITION                  equ 0007h
ODCONB_ODCONB7_SIZE                      equ 0001h
ODCONB_ODCONB7_LENGTH                    equ 0001h
ODCONB_ODCONB7_MASK                      equ 0080h
ODCONB_ODCONB_POSN                       equ 0000h
ODCONB_ODCONB_POSITION                   equ 0000h
ODCONB_ODCONB_SIZE                       equ 0008h
ODCONB_ODCONB_LENGTH                     equ 0008h
ODCONB_ODCONB_MASK                       equ 00FFh

// Register: ODCONC
#define ODCONC ODCONC
ODCONC                                   equ 028Eh
// bitfield definitions
ODCONC_ODCONC0_POSN                      equ 0000h
ODCONC_ODCONC0_POSITION                  equ 0000h
ODCONC_ODCONC0_SIZE                      equ 0001h
ODCONC_ODCONC0_LENGTH                    equ 0001h
ODCONC_ODCONC0_MASK                      equ 0001h
ODCONC_ODCONC1_POSN                      equ 0001h
ODCONC_ODCONC1_POSITION                  equ 0001h
ODCONC_ODCONC1_SIZE                      equ 0001h
ODCONC_ODCONC1_LENGTH                    equ 0001h
ODCONC_ODCONC1_MASK                      equ 0002h
ODCONC_ODCONC2_POSN                      equ 0002h
ODCONC_ODCONC2_POSITION                  equ 0002h
ODCONC_ODCONC2_SIZE                      equ 0001h
ODCONC_ODCONC2_LENGTH                    equ 0001h
ODCONC_ODCONC2_MASK                      equ 0004h
ODCONC_ODCONC3_POSN                      equ 0003h
ODCONC_ODCONC3_POSITION                  equ 0003h
ODCONC_ODCONC3_SIZE                      equ 0001h
ODCONC_ODCONC3_LENGTH                    equ 0001h
ODCONC_ODCONC3_MASK                      equ 0008h
ODCONC_ODCONC4_POSN                      equ 0004h
ODCONC_ODCONC4_POSITION                  equ 0004h
ODCONC_ODCONC4_SIZE                      equ 0001h
ODCONC_ODCONC4_LENGTH                    equ 0001h
ODCONC_ODCONC4_MASK                      equ 0010h
ODCONC_ODCONC5_POSN                      equ 0005h
ODCONC_ODCONC5_POSITION                  equ 0005h
ODCONC_ODCONC5_SIZE                      equ 0001h
ODCONC_ODCONC5_LENGTH                    equ 0001h
ODCONC_ODCONC5_MASK                      equ 0020h
ODCONC_ODCONC6_POSN                      equ 0006h
ODCONC_ODCONC6_POSITION                  equ 0006h
ODCONC_ODCONC6_SIZE                      equ 0001h
ODCONC_ODCONC6_LENGTH                    equ 0001h
ODCONC_ODCONC6_MASK                      equ 0040h
ODCONC_ODCONC7_POSN                      equ 0007h
ODCONC_ODCONC7_POSITION                  equ 0007h
ODCONC_ODCONC7_SIZE                      equ 0001h
ODCONC_ODCONC7_LENGTH                    equ 0001h
ODCONC_ODCONC7_MASK                      equ 0080h
ODCONC_ODCONC_POSN                       equ 0000h
ODCONC_ODCONC_POSITION                   equ 0000h
ODCONC_ODCONC_SIZE                       equ 0008h
ODCONC_ODCONC_LENGTH                     equ 0008h
ODCONC_ODCONC_MASK                       equ 00FFh

