GopalSaraf/Practicals/PSDL/include/proc/pic16f1787.inc
// Register: ODCOND
#define ODCOND ODCOND
ODCOND                                   equ 028Fh
// bitfield definitions
ODCOND_ODCOND0_POSN                      equ 0000h
ODCOND_ODCOND0_POSITION                  equ 0000h
ODCOND_ODCOND0_SIZE                      equ 0001h
ODCOND_ODCOND0_LENGTH                    equ 0001h
ODCOND_ODCOND0_MASK                      equ 0001h
ODCOND_ODCOND1_POSN                      equ 0001h
ODCOND_ODCOND1_POSITION                  equ 0001h
ODCOND_ODCOND1_SIZE                      equ 0001h
ODCOND_ODCOND1_LENGTH                    equ 0001h
ODCOND_ODCOND1_MASK                      equ 0002h
ODCOND_ODCOND2_POSN                      equ 0002h
ODCOND_ODCOND2_POSITION                  equ 0002h
ODCOND_ODCOND2_SIZE                      equ 0001h
ODCOND_ODCOND2_LENGTH                    equ 0001h
ODCOND_ODCOND2_MASK                      equ 0004h
ODCOND_ODCOND3_POSN                      equ 0003h
ODCOND_ODCOND3_POSITION                  equ 0003h
ODCOND_ODCOND3_SIZE                      equ 0001h
ODCOND_ODCOND3_LENGTH                    equ 0001h
ODCOND_ODCOND3_MASK                      equ 0008h
ODCOND_ODCOND4_POSN                      equ 0004h
ODCOND_ODCOND4_POSITION                  equ 0004h
ODCOND_ODCOND4_SIZE                      equ 0001h
ODCOND_ODCOND4_LENGTH                    equ 0001h
ODCOND_ODCOND4_MASK                      equ 0010h
ODCOND_ODCOND5_POSN                      equ 0005h
ODCOND_ODCOND5_POSITION                  equ 0005h
ODCOND_ODCOND5_SIZE                      equ 0001h
ODCOND_ODCOND5_LENGTH                    equ 0001h
ODCOND_ODCOND5_MASK                      equ 0020h
ODCOND_ODCOND6_POSN                      equ 0006h
ODCOND_ODCOND6_POSITION                  equ 0006h
ODCOND_ODCOND6_SIZE                      equ 0001h
ODCOND_ODCOND6_LENGTH                    equ 0001h
ODCOND_ODCOND6_MASK                      equ 0040h
ODCOND_ODCOND7_POSN                      equ 0007h
ODCOND_ODCOND7_POSITION                  equ 0007h
ODCOND_ODCOND7_SIZE                      equ 0001h
ODCOND_ODCOND7_LENGTH                    equ 0001h
ODCOND_ODCOND7_MASK                      equ 0080h
ODCOND_ODCOND_POSN                       equ 0000h
ODCOND_ODCOND_POSITION                   equ 0000h
ODCOND_ODCOND_SIZE                       equ 0008h
ODCOND_ODCOND_LENGTH                     equ 0008h
ODCOND_ODCOND_MASK                       equ 00FFh

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 0290h
// bitfield definitions
ODCONE_ODCONE0_POSN                      equ 0000h
ODCONE_ODCONE0_POSITION                  equ 0000h
ODCONE_ODCONE0_SIZE                      equ 0001h
ODCONE_ODCONE0_LENGTH                    equ 0001h
ODCONE_ODCONE0_MASK                      equ 0001h
ODCONE_ODCONE1_POSN                      equ 0001h
ODCONE_ODCONE1_POSITION                  equ 0001h
ODCONE_ODCONE1_SIZE                      equ 0001h
ODCONE_ODCONE1_LENGTH                    equ 0001h
ODCONE_ODCONE1_MASK                      equ 0002h
ODCONE_ODCONE2_POSN                      equ 0002h
ODCONE_ODCONE2_POSITION                  equ 0002h
ODCONE_ODCONE2_SIZE                      equ 0001h
ODCONE_ODCONE2_LENGTH                    equ 0001h
ODCONE_ODCONE2_MASK                      equ 0004h
ODCONE_ODCONE_POSN                       equ 0000h
ODCONE_ODCONE_POSITION                   equ 0000h
ODCONE_ODCONE_SIZE                       equ 0003h
ODCONE_ODCONE_LENGTH                     equ 0003h
ODCONE_ODCONE_MASK                       equ 0007h

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0291h
// bitfield definitions
CCPR1L_CCPR1L_POSN                       equ 0000h
CCPR1L_CCPR1L_POSITION                   equ 0000h
CCPR1L_CCPR1L_SIZE                       equ 0008h
CCPR1L_CCPR1L_LENGTH                     equ 0008h
CCPR1L_CCPR1L_MASK                       equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0292h
// bitfield definitions
CCPR1H_CCPR1H_POSN                       equ 0000h
CCPR1H_CCPR1H_POSITION                   equ 0000h
CCPR1H_CCPR1H_SIZE                       equ 0008h
CCPR1H_CCPR1H_LENGTH                     equ 0008h
CCPR1H_CCPR1H_MASK                       equ 00FFh

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 0293h
// bitfield definitions
CCP1CON_CCP1M_POSN                       equ 0000h
CCP1CON_CCP1M_POSITION                   equ 0000h
CCP1CON_CCP1M_SIZE                       equ 0004h
CCP1CON_CCP1M_LENGTH                     equ 0004h
CCP1CON_CCP1M_MASK                       equ 000Fh
CCP1CON_DC1B_POSN                        equ 0004h
CCP1CON_DC1B_POSITION                    equ 0004h
CCP1CON_DC1B_SIZE                        equ 0002h
CCP1CON_DC1B_LENGTH                      equ 0002h
CCP1CON_DC1B_MASK                        equ 0030h
CCP1CON_CCP1M0_POSN                      equ 0000h
CCP1CON_CCP1M0_POSITION                  equ 0000h
CCP1CON_CCP1M0_SIZE                      equ 0001h
CCP1CON_CCP1M0_LENGTH                    equ 0001h
CCP1CON_CCP1M0_MASK                      equ 0001h
CCP1CON_CCP1M1_POSN                      equ 0001h
CCP1CON_CCP1M1_POSITION                  equ 0001h
CCP1CON_CCP1M1_SIZE                      equ 0001h
CCP1CON_CCP1M1_LENGTH                    equ 0001h
CCP1CON_CCP1M1_MASK                      equ 0002h
CCP1CON_CCP1M2_POSN                      equ 0002h
CCP1CON_CCP1M2_POSITION                  equ 0002h
CCP1CON_CCP1M2_SIZE                      equ 0001h
CCP1CON_CCP1M2_LENGTH                    equ 0001h
CCP1CON_CCP1M2_MASK                      equ 0004h
CCP1CON_CCP1M3_POSN                      equ 0003h
CCP1CON_CCP1M3_POSITION                  equ 0003h
CCP1CON_CCP1M3_SIZE                      equ 0001h
CCP1CON_CCP1M3_LENGTH                    equ 0001h
CCP1CON_CCP1M3_MASK                      equ 0008h
CCP1CON_DC1B0_POSN                       equ 0004h
CCP1CON_DC1B0_POSITION                   equ 0004h
CCP1CON_DC1B0_SIZE                       equ 0001h
CCP1CON_DC1B0_LENGTH                     equ 0001h
CCP1CON_DC1B0_MASK                       equ 0010h
CCP1CON_DC1B1_POSN                       equ 0005h
CCP1CON_DC1B1_POSITION                   equ 0005h
CCP1CON_DC1B1_SIZE                       equ 0001h
CCP1CON_DC1B1_LENGTH                     equ 0001h
CCP1CON_DC1B1_MASK                       equ 0020h

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0298h
// bitfield definitions
CCPR2L_CCPR2L_POSN                       equ 0000h
CCPR2L_CCPR2L_POSITION                   equ 0000h
CCPR2L_CCPR2L_SIZE                       equ 0008h
CCPR2L_CCPR2L_LENGTH                     equ 0008h
CCPR2L_CCPR2L_MASK                       equ 00FFh

