GopalSaraf/Practicals/PSDL/include/proc/pic16f1787.inc
// Register: PSMC2DCL
#define PSMC2DCL PSMC2DCL
PSMC2DCL                                 equ 0843h
// bitfield definitions
PSMC2DCL_PSMC2DC0_POSN                   equ 0000h
PSMC2DCL_PSMC2DC0_POSITION               equ 0000h
PSMC2DCL_PSMC2DC0_SIZE                   equ 0001h
PSMC2DCL_PSMC2DC0_LENGTH                 equ 0001h
PSMC2DCL_PSMC2DC0_MASK                   equ 0001h
PSMC2DCL_PSMC2DC1_POSN                   equ 0001h
PSMC2DCL_PSMC2DC1_POSITION               equ 0001h
PSMC2DCL_PSMC2DC1_SIZE                   equ 0001h
PSMC2DCL_PSMC2DC1_LENGTH                 equ 0001h
PSMC2DCL_PSMC2DC1_MASK                   equ 0002h
PSMC2DCL_PSMC2DC2_POSN                   equ 0002h
PSMC2DCL_PSMC2DC2_POSITION               equ 0002h
PSMC2DCL_PSMC2DC2_SIZE                   equ 0001h
PSMC2DCL_PSMC2DC2_LENGTH                 equ 0001h
PSMC2DCL_PSMC2DC2_MASK                   equ 0004h
PSMC2DCL_PSMC2DC3_POSN                   equ 0003h
PSMC2DCL_PSMC2DC3_POSITION               equ 0003h
PSMC2DCL_PSMC2DC3_SIZE                   equ 0001h
PSMC2DCL_PSMC2DC3_LENGTH                 equ 0001h
PSMC2DCL_PSMC2DC3_MASK                   equ 0008h
PSMC2DCL_PSMC2DC4_POSN                   equ 0004h
PSMC2DCL_PSMC2DC4_POSITION               equ 0004h
PSMC2DCL_PSMC2DC4_SIZE                   equ 0001h
PSMC2DCL_PSMC2DC4_LENGTH                 equ 0001h
PSMC2DCL_PSMC2DC4_MASK                   equ 0010h
PSMC2DCL_PSMC2DC5_POSN                   equ 0005h
PSMC2DCL_PSMC2DC5_POSITION               equ 0005h
PSMC2DCL_PSMC2DC5_SIZE                   equ 0001h
PSMC2DCL_PSMC2DC5_LENGTH                 equ 0001h
PSMC2DCL_PSMC2DC5_MASK                   equ 0020h
PSMC2DCL_PSMC2DC6_POSN                   equ 0006h
PSMC2DCL_PSMC2DC6_POSITION               equ 0006h
PSMC2DCL_PSMC2DC6_SIZE                   equ 0001h
PSMC2DCL_PSMC2DC6_LENGTH                 equ 0001h
PSMC2DCL_PSMC2DC6_MASK                   equ 0040h
PSMC2DCL_PSMC2DC7_POSN                   equ 0007h
PSMC2DCL_PSMC2DC7_POSITION               equ 0007h
PSMC2DCL_PSMC2DC7_SIZE                   equ 0001h
PSMC2DCL_PSMC2DC7_LENGTH                 equ 0001h
PSMC2DCL_PSMC2DC7_MASK                   equ 0080h

// Register: PSMC2DCH
#define PSMC2DCH PSMC2DCH
PSMC2DCH                                 equ 0844h
// bitfield definitions
PSMC2DCH_PSMC2DC8_POSN                   equ 0000h
PSMC2DCH_PSMC2DC8_POSITION               equ 0000h
PSMC2DCH_PSMC2DC8_SIZE                   equ 0001h
PSMC2DCH_PSMC2DC8_LENGTH                 equ 0001h
PSMC2DCH_PSMC2DC8_MASK                   equ 0001h
PSMC2DCH_PSMC2DC9_POSN                   equ 0001h
PSMC2DCH_PSMC2DC9_POSITION               equ 0001h
PSMC2DCH_PSMC2DC9_SIZE                   equ 0001h
PSMC2DCH_PSMC2DC9_LENGTH                 equ 0001h
PSMC2DCH_PSMC2DC9_MASK                   equ 0002h
PSMC2DCH_PSMC2DC10_POSN                  equ 0002h
PSMC2DCH_PSMC2DC10_POSITION              equ 0002h
PSMC2DCH_PSMC2DC10_SIZE                  equ 0001h
PSMC2DCH_PSMC2DC10_LENGTH                equ 0001h
PSMC2DCH_PSMC2DC10_MASK                  equ 0004h
PSMC2DCH_PSMC2DC11_POSN                  equ 0003h
PSMC2DCH_PSMC2DC11_POSITION              equ 0003h
PSMC2DCH_PSMC2DC11_SIZE                  equ 0001h
PSMC2DCH_PSMC2DC11_LENGTH                equ 0001h
PSMC2DCH_PSMC2DC11_MASK                  equ 0008h
PSMC2DCH_PSMC2DC12_POSN                  equ 0004h
PSMC2DCH_PSMC2DC12_POSITION              equ 0004h
PSMC2DCH_PSMC2DC12_SIZE                  equ 0001h
PSMC2DCH_PSMC2DC12_LENGTH                equ 0001h
PSMC2DCH_PSMC2DC12_MASK                  equ 0010h
PSMC2DCH_PSMC2DC13_POSN                  equ 0005h
PSMC2DCH_PSMC2DC13_POSITION              equ 0005h
PSMC2DCH_PSMC2DC13_SIZE                  equ 0001h
PSMC2DCH_PSMC2DC13_LENGTH                equ 0001h
PSMC2DCH_PSMC2DC13_MASK                  equ 0020h
PSMC2DCH_PSMC2DC14_POSN                  equ 0006h
PSMC2DCH_PSMC2DC14_POSITION              equ 0006h
PSMC2DCH_PSMC2DC14_SIZE                  equ 0001h
PSMC2DCH_PSMC2DC14_LENGTH                equ 0001h
PSMC2DCH_PSMC2DC14_MASK                  equ 0040h
PSMC2DCH_PSMC2DC15_POSN                  equ 0007h
PSMC2DCH_PSMC2DC15_POSITION              equ 0007h
PSMC2DCH_PSMC2DC15_SIZE                  equ 0001h
PSMC2DCH_PSMC2DC15_LENGTH                equ 0001h
PSMC2DCH_PSMC2DC15_MASK                  equ 0080h

// Register: PSMC2PRL
#define PSMC2PRL PSMC2PRL
PSMC2PRL                                 equ 0845h
// bitfield definitions
PSMC2PRL_PSMC2PR0_POSN                   equ 0000h
PSMC2PRL_PSMC2PR0_POSITION               equ 0000h
PSMC2PRL_PSMC2PR0_SIZE                   equ 0001h
PSMC2PRL_PSMC2PR0_LENGTH                 equ 0001h
PSMC2PRL_PSMC2PR0_MASK                   equ 0001h
PSMC2PRL_PSMC2PR1_POSN                   equ 0001h
PSMC2PRL_PSMC2PR1_POSITION               equ 0001h
PSMC2PRL_PSMC2PR1_SIZE                   equ 0001h
PSMC2PRL_PSMC2PR1_LENGTH                 equ 0001h
PSMC2PRL_PSMC2PR1_MASK                   equ 0002h
PSMC2PRL_PSMC2PR2_POSN                   equ 0002h
PSMC2PRL_PSMC2PR2_POSITION               equ 0002h
PSMC2PRL_PSMC2PR2_SIZE                   equ 0001h
PSMC2PRL_PSMC2PR2_LENGTH                 equ 0001h
PSMC2PRL_PSMC2PR2_MASK                   equ 0004h
PSMC2PRL_PSMC2PR3_POSN                   equ 0003h
PSMC2PRL_PSMC2PR3_POSITION               equ 0003h
PSMC2PRL_PSMC2PR3_SIZE                   equ 0001h
PSMC2PRL_PSMC2PR3_LENGTH                 equ 0001h
PSMC2PRL_PSMC2PR3_MASK                   equ 0008h
PSMC2PRL_PSMC2PR4_POSN                   equ 0004h
PSMC2PRL_PSMC2PR4_POSITION               equ 0004h
PSMC2PRL_PSMC2PR4_SIZE                   equ 0001h
PSMC2PRL_PSMC2PR4_LENGTH                 equ 0001h
PSMC2PRL_PSMC2PR4_MASK                   equ 0010h
PSMC2PRL_PSMC2PR5_POSN                   equ 0005h
PSMC2PRL_PSMC2PR5_POSITION               equ 0005h
PSMC2PRL_PSMC2PR5_SIZE                   equ 0001h
PSMC2PRL_PSMC2PR5_LENGTH                 equ 0001h
PSMC2PRL_PSMC2PR5_MASK                   equ 0020h
PSMC2PRL_PSMC2PR6_POSN                   equ 0006h
PSMC2PRL_PSMC2PR6_POSITION               equ 0006h
PSMC2PRL_PSMC2PR6_SIZE                   equ 0001h
PSMC2PRL_PSMC2PR6_LENGTH                 equ 0001h
PSMC2PRL_PSMC2PR6_MASK                   equ 0040h
PSMC2PRL_PSMC2PR7_POSN                   equ 0007h
PSMC2PRL_PSMC2PR7_POSITION               equ 0007h
PSMC2PRL_PSMC2PR7_SIZE                   equ 0001h
PSMC2PRL_PSMC2PR7_LENGTH                 equ 0001h
PSMC2PRL_PSMC2PR7_MASK                   equ 0080h

// Register: PSMC2PRH
#define PSMC2PRH PSMC2PRH
PSMC2PRH                                 equ 0846h
// bitfield definitions
PSMC2PRH_PSMC2PR8_POSN                   equ 0000h
PSMC2PRH_PSMC2PR8_POSITION               equ 0000h
PSMC2PRH_PSMC2PR8_SIZE                   equ 0001h
PSMC2PRH_PSMC2PR8_LENGTH                 equ 0001h
PSMC2PRH_PSMC2PR8_MASK                   equ 0001h
PSMC2PRH_PSMC2PR9_POSN                   equ 0001h
PSMC2PRH_PSMC2PR9_POSITION               equ 0001h
PSMC2PRH_PSMC2PR9_SIZE                   equ 0001h
PSMC2PRH_PSMC2PR9_LENGTH                 equ 0001h
PSMC2PRH_PSMC2PR9_MASK                   equ 0002h
PSMC2PRH_PSMC2PR10_POSN                  equ 0002h
PSMC2PRH_PSMC2PR10_POSITION              equ 0002h
PSMC2PRH_PSMC2PR10_SIZE                  equ 0001h
PSMC2PRH_PSMC2PR10_LENGTH                equ 0001h
PSMC2PRH_PSMC2PR10_MASK                  equ 0004h
PSMC2PRH_PSMC2PR11_POSN                  equ 0003h
PSMC2PRH_PSMC2PR11_POSITION              equ 0003h
PSMC2PRH_PSMC2PR11_SIZE                  equ 0001h
PSMC2PRH_PSMC2PR11_LENGTH                equ 0001h
PSMC2PRH_PSMC2PR11_MASK                  equ 0008h
PSMC2PRH_PSMC2PR12_POSN                  equ 0004h
PSMC2PRH_PSMC2PR12_POSITION              equ 0004h
PSMC2PRH_PSMC2PR12_SIZE                  equ 0001h
PSMC2PRH_PSMC2PR12_LENGTH                equ 0001h
PSMC2PRH_PSMC2PR12_MASK                  equ 0010h
PSMC2PRH_PSMC2PR13_POSN                  equ 0005h
PSMC2PRH_PSMC2PR13_POSITION              equ 0005h
PSMC2PRH_PSMC2PR13_SIZE                  equ 0001h
PSMC2PRH_PSMC2PR13_LENGTH                equ 0001h
PSMC2PRH_PSMC2PR13_MASK                  equ 0020h
PSMC2PRH_PSMC2PR14_POSN                  equ 0006h
PSMC2PRH_PSMC2PR14_POSITION              equ 0006h
PSMC2PRH_PSMC2PR14_SIZE                  equ 0001h
PSMC2PRH_PSMC2PR14_LENGTH                equ 0001h
PSMC2PRH_PSMC2PR14_MASK                  equ 0040h
PSMC2PRH_PSMC2PR15_POSN                  equ 0007h
PSMC2PRH_PSMC2PR15_POSITION              equ 0007h
PSMC2PRH_PSMC2PR15_SIZE                  equ 0001h
PSMC2PRH_PSMC2PR15_LENGTH                equ 0001h
PSMC2PRH_PSMC2PR15_MASK                  equ 0080h

// Register: PSMC2TMRL
#define PSMC2TMRL PSMC2TMRL
PSMC2TMRL                                equ 0847h
// bitfield definitions
PSMC2TMRL_PSMC2TMR0_POSN                 equ 0000h
PSMC2TMRL_PSMC2TMR0_POSITION             equ 0000h
PSMC2TMRL_PSMC2TMR0_SIZE                 equ 0001h
PSMC2TMRL_PSMC2TMR0_LENGTH               equ 0001h
PSMC2TMRL_PSMC2TMR0_MASK                 equ 0001h
PSMC2TMRL_PSMC2TMR1_POSN                 equ 0001h
PSMC2TMRL_PSMC2TMR1_POSITION             equ 0001h
PSMC2TMRL_PSMC2TMR1_SIZE                 equ 0001h
PSMC2TMRL_PSMC2TMR1_LENGTH               equ 0001h
PSMC2TMRL_PSMC2TMR1_MASK                 equ 0002h
PSMC2TMRL_PSMC2TMR2_POSN                 equ 0002h
PSMC2TMRL_PSMC2TMR2_POSITION             equ 0002h
PSMC2TMRL_PSMC2TMR2_SIZE                 equ 0001h
PSMC2TMRL_PSMC2TMR2_LENGTH               equ 0001h
PSMC2TMRL_PSMC2TMR2_MASK                 equ 0004h
PSMC2TMRL_PSMC2TMR3_POSN                 equ 0003h
PSMC2TMRL_PSMC2TMR3_POSITION             equ 0003h
PSMC2TMRL_PSMC2TMR3_SIZE                 equ 0001h
PSMC2TMRL_PSMC2TMR3_LENGTH               equ 0001h
PSMC2TMRL_PSMC2TMR3_MASK                 equ 0008h
PSMC2TMRL_PSMC2TMR4_POSN                 equ 0004h
PSMC2TMRL_PSMC2TMR4_POSITION             equ 0004h
PSMC2TMRL_PSMC2TMR4_SIZE                 equ 0001h
PSMC2TMRL_PSMC2TMR4_LENGTH               equ 0001h
PSMC2TMRL_PSMC2TMR4_MASK                 equ 0010h
PSMC2TMRL_PSMC2TMR5_POSN                 equ 0005h
PSMC2TMRL_PSMC2TMR5_POSITION             equ 0005h
PSMC2TMRL_PSMC2TMR5_SIZE                 equ 0001h
PSMC2TMRL_PSMC2TMR5_LENGTH               equ 0001h
PSMC2TMRL_PSMC2TMR5_MASK                 equ 0020h
PSMC2TMRL_PSMC2TMR6_POSN                 equ 0006h
PSMC2TMRL_PSMC2TMR6_POSITION             equ 0006h
PSMC2TMRL_PSMC2TMR6_SIZE                 equ 0001h
PSMC2TMRL_PSMC2TMR6_LENGTH               equ 0001h
PSMC2TMRL_PSMC2TMR6_MASK                 equ 0040h
PSMC2TMRL_PSMC2TMR7_POSN                 equ 0007h
PSMC2TMRL_PSMC2TMR7_POSITION             equ 0007h
PSMC2TMRL_PSMC2TMR7_SIZE                 equ 0001h
PSMC2TMRL_PSMC2TMR7_LENGTH               equ 0001h
PSMC2TMRL_PSMC2TMR7_MASK                 equ 0080h

// Register: PSMC2TMRH
#define PSMC2TMRH PSMC2TMRH
PSMC2TMRH                                equ 0848h
// bitfield definitions
PSMC2TMRH_PSMC2TMR8_POSN                 equ 0000h
PSMC2TMRH_PSMC2TMR8_POSITION             equ 0000h
PSMC2TMRH_PSMC2TMR8_SIZE                 equ 0001h
PSMC2TMRH_PSMC2TMR8_LENGTH               equ 0001h
PSMC2TMRH_PSMC2TMR8_MASK                 equ 0001h
PSMC2TMRH_PSMC2TMR9_POSN                 equ 0001h
PSMC2TMRH_PSMC2TMR9_POSITION             equ 0001h
PSMC2TMRH_PSMC2TMR9_SIZE                 equ 0001h
PSMC2TMRH_PSMC2TMR9_LENGTH               equ 0001h
PSMC2TMRH_PSMC2TMR9_MASK                 equ 0002h
PSMC2TMRH_PSMC2TMR10_POSN                equ 0002h
PSMC2TMRH_PSMC2TMR10_POSITION            equ 0002h
PSMC2TMRH_PSMC2TMR10_SIZE                equ 0001h
PSMC2TMRH_PSMC2TMR10_LENGTH              equ 0001h
PSMC2TMRH_PSMC2TMR10_MASK                equ 0004h
PSMC2TMRH_PSMC2TMR11_POSN                equ 0003h
PSMC2TMRH_PSMC2TMR11_POSITION            equ 0003h
PSMC2TMRH_PSMC2TMR11_SIZE                equ 0001h
PSMC2TMRH_PSMC2TMR11_LENGTH              equ 0001h
PSMC2TMRH_PSMC2TMR11_MASK                equ 0008h
PSMC2TMRH_PSMC2TMR12_POSN                equ 0004h
PSMC2TMRH_PSMC2TMR12_POSITION            equ 0004h
PSMC2TMRH_PSMC2TMR12_SIZE                equ 0001h
PSMC2TMRH_PSMC2TMR12_LENGTH              equ 0001h
PSMC2TMRH_PSMC2TMR12_MASK                equ 0010h
PSMC2TMRH_PSMC2TMR13_POSN                equ 0005h
PSMC2TMRH_PSMC2TMR13_POSITION            equ 0005h
PSMC2TMRH_PSMC2TMR13_SIZE                equ 0001h
PSMC2TMRH_PSMC2TMR13_LENGTH              equ 0001h
PSMC2TMRH_PSMC2TMR13_MASK                equ 0020h
PSMC2TMRH_PSMC2TMR14_POSN                equ 0006h
PSMC2TMRH_PSMC2TMR14_POSITION            equ 0006h
PSMC2TMRH_PSMC2TMR14_SIZE                equ 0001h
PSMC2TMRH_PSMC2TMR14_LENGTH              equ 0001h
PSMC2TMRH_PSMC2TMR14_MASK                equ 0040h
PSMC2TMRH_PSMC2TMR15_POSN                equ 0007h
PSMC2TMRH_PSMC2TMR15_POSITION            equ 0007h
PSMC2TMRH_PSMC2TMR15_SIZE                equ 0001h
PSMC2TMRH_PSMC2TMR15_LENGTH              equ 0001h
PSMC2TMRH_PSMC2TMR15_MASK                equ 0080h

// Register: PSMC2DBR
#define PSMC2DBR PSMC2DBR
PSMC2DBR                                 equ 0849h
// bitfield definitions
PSMC2DBR_PSMC2DBR0_POSN                  equ 0000h
PSMC2DBR_PSMC2DBR0_POSITION              equ 0000h
PSMC2DBR_PSMC2DBR0_SIZE                  equ 0001h
PSMC2DBR_PSMC2DBR0_LENGTH                equ 0001h
PSMC2DBR_PSMC2DBR0_MASK                  equ 0001h
PSMC2DBR_PSMC2DBR1_POSN                  equ 0001h
PSMC2DBR_PSMC2DBR1_POSITION              equ 0001h
PSMC2DBR_PSMC2DBR1_SIZE                  equ 0001h
PSMC2DBR_PSMC2DBR1_LENGTH                equ 0001h
PSMC2DBR_PSMC2DBR1_MASK                  equ 0002h
PSMC2DBR_PSMC2DBR2_POSN                  equ 0002h
PSMC2DBR_PSMC2DBR2_POSITION              equ 0002h
PSMC2DBR_PSMC2DBR2_SIZE                  equ 0001h
PSMC2DBR_PSMC2DBR2_LENGTH                equ 0001h
PSMC2DBR_PSMC2DBR2_MASK                  equ 0004h
PSMC2DBR_PSMC2DBR3_POSN                  equ 0003h
PSMC2DBR_PSMC2DBR3_POSITION              equ 0003h
PSMC2DBR_PSMC2DBR3_SIZE                  equ 0001h
PSMC2DBR_PSMC2DBR3_LENGTH                equ 0001h
PSMC2DBR_PSMC2DBR3_MASK                  equ 0008h
PSMC2DBR_PSMC2DBR4_POSN                  equ 0004h
PSMC2DBR_PSMC2DBR4_POSITION              equ 0004h
PSMC2DBR_PSMC2DBR4_SIZE                  equ 0001h
PSMC2DBR_PSMC2DBR4_LENGTH                equ 0001h
PSMC2DBR_PSMC2DBR4_MASK                  equ 0010h
PSMC2DBR_PSMC2DBR5_POSN                  equ 0005h
PSMC2DBR_PSMC2DBR5_POSITION              equ 0005h
PSMC2DBR_PSMC2DBR5_SIZE                  equ 0001h
PSMC2DBR_PSMC2DBR5_LENGTH                equ 0001h
PSMC2DBR_PSMC2DBR5_MASK                  equ 0020h
PSMC2DBR_PSMC2DBR6_POSN                  equ 0006h
PSMC2DBR_PSMC2DBR6_POSITION              equ 0006h
PSMC2DBR_PSMC2DBR6_SIZE                  equ 0001h
PSMC2DBR_PSMC2DBR6_LENGTH                equ 0001h
PSMC2DBR_PSMC2DBR6_MASK                  equ 0040h
PSMC2DBR_PSMC2DBR7_POSN                  equ 0007h
PSMC2DBR_PSMC2DBR7_POSITION              equ 0007h
PSMC2DBR_PSMC2DBR7_SIZE                  equ 0001h
PSMC2DBR_PSMC2DBR7_LENGTH                equ 0001h
PSMC2DBR_PSMC2DBR7_MASK                  equ 0080h

// Register: PSMC2DBF
#define PSMC2DBF PSMC2DBF
PSMC2DBF                                 equ 084Ah
// bitfield definitions
PSMC2DBF_PSMC2DBF0_POSN                  equ 0000h
PSMC2DBF_PSMC2DBF0_POSITION              equ 0000h
PSMC2DBF_PSMC2DBF0_SIZE                  equ 0001h
PSMC2DBF_PSMC2DBF0_LENGTH                equ 0001h
PSMC2DBF_PSMC2DBF0_MASK                  equ 0001h
PSMC2DBF_PSMC2DBF1_POSN                  equ 0001h
PSMC2DBF_PSMC2DBF1_POSITION              equ 0001h
PSMC2DBF_PSMC2DBF1_SIZE                  equ 0001h
PSMC2DBF_PSMC2DBF1_LENGTH                equ 0001h
PSMC2DBF_PSMC2DBF1_MASK                  equ 0002h
PSMC2DBF_PSMC2DBF2_POSN                  equ 0002h
PSMC2DBF_PSMC2DBF2_POSITION              equ 0002h
PSMC2DBF_PSMC2DBF2_SIZE                  equ 0001h
PSMC2DBF_PSMC2DBF2_LENGTH                equ 0001h
PSMC2DBF_PSMC2DBF2_MASK                  equ 0004h
PSMC2DBF_PSMC2DBF3_POSN                  equ 0003h
PSMC2DBF_PSMC2DBF3_POSITION              equ 0003h
PSMC2DBF_PSMC2DBF3_SIZE                  equ 0001h
PSMC2DBF_PSMC2DBF3_LENGTH                equ 0001h
PSMC2DBF_PSMC2DBF3_MASK                  equ 0008h
PSMC2DBF_PSMC2DBF4_POSN                  equ 0004h
PSMC2DBF_PSMC2DBF4_POSITION              equ 0004h
PSMC2DBF_PSMC2DBF4_SIZE                  equ 0001h
PSMC2DBF_PSMC2DBF4_LENGTH                equ 0001h
PSMC2DBF_PSMC2DBF4_MASK                  equ 0010h
PSMC2DBF_PSMC2DBF5_POSN                  equ 0005h
PSMC2DBF_PSMC2DBF5_POSITION              equ 0005h
PSMC2DBF_PSMC2DBF5_SIZE                  equ 0001h
PSMC2DBF_PSMC2DBF5_LENGTH                equ 0001h
PSMC2DBF_PSMC2DBF5_MASK                  equ 0020h
PSMC2DBF_PSMC2DBF6_POSN                  equ 0006h
PSMC2DBF_PSMC2DBF6_POSITION              equ 0006h
PSMC2DBF_PSMC2DBF6_SIZE                  equ 0001h
PSMC2DBF_PSMC2DBF6_LENGTH                equ 0001h
PSMC2DBF_PSMC2DBF6_MASK                  equ 0040h
PSMC2DBF_PSMC2DBF7_POSN                  equ 0007h
PSMC2DBF_PSMC2DBF7_POSITION              equ 0007h
PSMC2DBF_PSMC2DBF7_SIZE                  equ 0001h
PSMC2DBF_PSMC2DBF7_LENGTH                equ 0001h
PSMC2DBF_PSMC2DBF7_MASK                  equ 0080h

// Register: PSMC2BLKR
#define PSMC2BLKR PSMC2BLKR
PSMC2BLKR                                equ 084Bh
// bitfield definitions
PSMC2BLKR_PSMC2BLKR0_POSN                equ 0000h
PSMC2BLKR_PSMC2BLKR0_POSITION            equ 0000h
PSMC2BLKR_PSMC2BLKR0_SIZE                equ 0001h
PSMC2BLKR_PSMC2BLKR0_LENGTH              equ 0001h
PSMC2BLKR_PSMC2BLKR0_MASK                equ 0001h
PSMC2BLKR_PSMC2BLKR1_POSN                equ 0001h
PSMC2BLKR_PSMC2BLKR1_POSITION            equ 0001h
PSMC2BLKR_PSMC2BLKR1_SIZE                equ 0001h
PSMC2BLKR_PSMC2BLKR1_LENGTH              equ 0001h
PSMC2BLKR_PSMC2BLKR1_MASK                equ 0002h
PSMC2BLKR_PSMC2BLKR2_POSN                equ 0002h
PSMC2BLKR_PSMC2BLKR2_POSITION            equ 0002h
PSMC2BLKR_PSMC2BLKR2_SIZE                equ 0001h
PSMC2BLKR_PSMC2BLKR2_LENGTH              equ 0001h
PSMC2BLKR_PSMC2BLKR2_MASK                equ 0004h
PSMC2BLKR_PSMC2BLKR3_POSN                equ 0003h
PSMC2BLKR_PSMC2BLKR3_POSITION            equ 0003h
PSMC2BLKR_PSMC2BLKR3_SIZE                equ 0001h
PSMC2BLKR_PSMC2BLKR3_LENGTH              equ 0001h
PSMC2BLKR_PSMC2BLKR3_MASK                equ 0008h
PSMC2BLKR_PSMC2BLKR4_POSN                equ 0004h
PSMC2BLKR_PSMC2BLKR4_POSITION            equ 0004h
PSMC2BLKR_PSMC2BLKR4_SIZE                equ 0001h
PSMC2BLKR_PSMC2BLKR4_LENGTH              equ 0001h
PSMC2BLKR_PSMC2BLKR4_MASK                equ 0010h
PSMC2BLKR_PSMC2BLKR5_POSN                equ 0005h
PSMC2BLKR_PSMC2BLKR5_POSITION            equ 0005h
PSMC2BLKR_PSMC2BLKR5_SIZE                equ 0001h
PSMC2BLKR_PSMC2BLKR5_LENGTH              equ 0001h
PSMC2BLKR_PSMC2BLKR5_MASK                equ 0020h
PSMC2BLKR_PSMC2BLKR6_POSN                equ 0006h
PSMC2BLKR_PSMC2BLKR6_POSITION            equ 0006h
PSMC2BLKR_PSMC2BLKR6_SIZE                equ 0001h
PSMC2BLKR_PSMC2BLKR6_LENGTH              equ 0001h
PSMC2BLKR_PSMC2BLKR6_MASK                equ 0040h
PSMC2BLKR_PSMC2BLKR7_POSN                equ 0007h
PSMC2BLKR_PSMC2BLKR7_POSITION            equ 0007h
PSMC2BLKR_PSMC2BLKR7_SIZE                equ 0001h
PSMC2BLKR_PSMC2BLKR7_LENGTH              equ 0001h
PSMC2BLKR_PSMC2BLKR7_MASK                equ 0080h

