GopalSaraf/Practicals/PSDL/include/proc/pic16f1787.inc
// Register: PSMC3CLK
#define PSMC3CLK PSMC3CLK
PSMC3CLK                                 equ 0854h
// bitfield definitions
PSMC3CLK_P3CSRC0_POSN                    equ 0000h
PSMC3CLK_P3CSRC0_POSITION                equ 0000h
PSMC3CLK_P3CSRC0_SIZE                    equ 0001h
PSMC3CLK_P3CSRC0_LENGTH                  equ 0001h
PSMC3CLK_P3CSRC0_MASK                    equ 0001h
PSMC3CLK_P3CSRC1_POSN                    equ 0001h
PSMC3CLK_P3CSRC1_POSITION                equ 0001h
PSMC3CLK_P3CSRC1_SIZE                    equ 0001h
PSMC3CLK_P3CSRC1_LENGTH                  equ 0001h
PSMC3CLK_P3CSRC1_MASK                    equ 0002h
PSMC3CLK_P3CPRE0_POSN                    equ 0004h
PSMC3CLK_P3CPRE0_POSITION                equ 0004h
PSMC3CLK_P3CPRE0_SIZE                    equ 0001h
PSMC3CLK_P3CPRE0_LENGTH                  equ 0001h
PSMC3CLK_P3CPRE0_MASK                    equ 0010h
PSMC3CLK_P3CPRE1_POSN                    equ 0005h
PSMC3CLK_P3CPRE1_POSITION                equ 0005h
PSMC3CLK_P3CPRE1_SIZE                    equ 0001h
PSMC3CLK_P3CPRE1_LENGTH                  equ 0001h
PSMC3CLK_P3CPRE1_MASK                    equ 0020h
PSMC3CLK_P3CSRC_POSN                     equ 0000h
PSMC3CLK_P3CSRC_POSITION                 equ 0000h
PSMC3CLK_P3CSRC_SIZE                     equ 0002h
PSMC3CLK_P3CSRC_LENGTH                   equ 0002h
PSMC3CLK_P3CSRC_MASK                     equ 0003h
PSMC3CLK_P3CPRE_POSN                     equ 0004h
PSMC3CLK_P3CPRE_POSITION                 equ 0004h
PSMC3CLK_P3CPRE_SIZE                     equ 0002h
PSMC3CLK_P3CPRE_LENGTH                   equ 0002h
PSMC3CLK_P3CPRE_MASK                     equ 0030h

// Register: PSMC3OEN
#define PSMC3OEN PSMC3OEN
PSMC3OEN                                 equ 0855h
// bitfield definitions
PSMC3OEN_P3OEA_POSN                      equ 0000h
PSMC3OEN_P3OEA_POSITION                  equ 0000h
PSMC3OEN_P3OEA_SIZE                      equ 0001h
PSMC3OEN_P3OEA_LENGTH                    equ 0001h
PSMC3OEN_P3OEA_MASK                      equ 0001h
PSMC3OEN_P3OEB_POSN                      equ 0001h
PSMC3OEN_P3OEB_POSITION                  equ 0001h
PSMC3OEN_P3OEB_SIZE                      equ 0001h
PSMC3OEN_P3OEB_LENGTH                    equ 0001h
PSMC3OEN_P3OEB_MASK                      equ 0002h
PSMC3OEN_P3OEC_POSN                      equ 0002h
PSMC3OEN_P3OEC_POSITION                  equ 0002h
PSMC3OEN_P3OEC_SIZE                      equ 0001h
PSMC3OEN_P3OEC_LENGTH                    equ 0001h
PSMC3OEN_P3OEC_MASK                      equ 0004h
PSMC3OEN_P3OED_POSN                      equ 0003h
PSMC3OEN_P3OED_POSITION                  equ 0003h
PSMC3OEN_P3OED_SIZE                      equ 0001h
PSMC3OEN_P3OED_LENGTH                    equ 0001h
PSMC3OEN_P3OED_MASK                      equ 0008h
PSMC3OEN_P3OEE_POSN                      equ 0004h
PSMC3OEN_P3OEE_POSITION                  equ 0004h
PSMC3OEN_P3OEE_SIZE                      equ 0001h
PSMC3OEN_P3OEE_LENGTH                    equ 0001h
PSMC3OEN_P3OEE_MASK                      equ 0010h
PSMC3OEN_P3OEF_POSN                      equ 0005h
PSMC3OEN_P3OEF_POSITION                  equ 0005h
PSMC3OEN_P3OEF_SIZE                      equ 0001h
PSMC3OEN_P3OEF_LENGTH                    equ 0001h
PSMC3OEN_P3OEF_MASK                      equ 0020h

// Register: PSMC3POL
#define PSMC3POL PSMC3POL
PSMC3POL                                 equ 0856h
// bitfield definitions
PSMC3POL_P3POLA_POSN                     equ 0000h
PSMC3POL_P3POLA_POSITION                 equ 0000h
PSMC3POL_P3POLA_SIZE                     equ 0001h
PSMC3POL_P3POLA_LENGTH                   equ 0001h
PSMC3POL_P3POLA_MASK                     equ 0001h
PSMC3POL_P3POLB_POSN                     equ 0001h
PSMC3POL_P3POLB_POSITION                 equ 0001h
PSMC3POL_P3POLB_SIZE                     equ 0001h
PSMC3POL_P3POLB_LENGTH                   equ 0001h
PSMC3POL_P3POLB_MASK                     equ 0002h
PSMC3POL_P3POLC_POSN                     equ 0002h
PSMC3POL_P3POLC_POSITION                 equ 0002h
PSMC3POL_P3POLC_SIZE                     equ 0001h
PSMC3POL_P3POLC_LENGTH                   equ 0001h
PSMC3POL_P3POLC_MASK                     equ 0004h
PSMC3POL_P3POLD_POSN                     equ 0003h
PSMC3POL_P3POLD_POSITION                 equ 0003h
PSMC3POL_P3POLD_SIZE                     equ 0001h
PSMC3POL_P3POLD_LENGTH                   equ 0001h
PSMC3POL_P3POLD_MASK                     equ 0008h
PSMC3POL_P3POLE_POSN                     equ 0004h
PSMC3POL_P3POLE_POSITION                 equ 0004h
PSMC3POL_P3POLE_SIZE                     equ 0001h
PSMC3POL_P3POLE_LENGTH                   equ 0001h
PSMC3POL_P3POLE_MASK                     equ 0010h
PSMC3POL_P3POLF_POSN                     equ 0005h
PSMC3POL_P3POLF_POSITION                 equ 0005h
PSMC3POL_P3POLF_SIZE                     equ 0001h
PSMC3POL_P3POLF_LENGTH                   equ 0001h
PSMC3POL_P3POLF_MASK                     equ 0020h
PSMC3POL_P3INPOL_POSN                    equ 0006h
PSMC3POL_P3INPOL_POSITION                equ 0006h
PSMC3POL_P3INPOL_SIZE                    equ 0001h
PSMC3POL_P3INPOL_LENGTH                  equ 0001h
PSMC3POL_P3INPOL_MASK                    equ 0040h

// Register: PSMC3BLNK
#define PSMC3BLNK PSMC3BLNK
PSMC3BLNK                                equ 0857h
// bitfield definitions
PSMC3BLNK_P3REBM_POSN                    equ 0000h
PSMC3BLNK_P3REBM_POSITION                equ 0000h
PSMC3BLNK_P3REBM_SIZE                    equ 0002h
PSMC3BLNK_P3REBM_LENGTH                  equ 0002h
PSMC3BLNK_P3REBM_MASK                    equ 0003h
PSMC3BLNK_P3FEBM_POSN                    equ 0004h
PSMC3BLNK_P3FEBM_POSITION                equ 0004h
PSMC3BLNK_P3FEBM_SIZE                    equ 0002h
PSMC3BLNK_P3FEBM_LENGTH                  equ 0002h
PSMC3BLNK_P3FEBM_MASK                    equ 0030h
PSMC3BLNK_P3REBM0_POSN                   equ 0000h
PSMC3BLNK_P3REBM0_POSITION               equ 0000h
PSMC3BLNK_P3REBM0_SIZE                   equ 0001h
PSMC3BLNK_P3REBM0_LENGTH                 equ 0001h
PSMC3BLNK_P3REBM0_MASK                   equ 0001h
PSMC3BLNK_P3REBM1_POSN                   equ 0001h
PSMC3BLNK_P3REBM1_POSITION               equ 0001h
PSMC3BLNK_P3REBM1_SIZE                   equ 0001h
PSMC3BLNK_P3REBM1_LENGTH                 equ 0001h
PSMC3BLNK_P3REBM1_MASK                   equ 0002h
PSMC3BLNK_P3FEBM0_POSN                   equ 0004h
PSMC3BLNK_P3FEBM0_POSITION               equ 0004h
PSMC3BLNK_P3FEBM0_SIZE                   equ 0001h
PSMC3BLNK_P3FEBM0_LENGTH                 equ 0001h
PSMC3BLNK_P3FEBM0_MASK                   equ 0010h
PSMC3BLNK_P3FEBM1_POSN                   equ 0005h
PSMC3BLNK_P3FEBM1_POSITION               equ 0005h
PSMC3BLNK_P3FEBM1_SIZE                   equ 0001h
PSMC3BLNK_P3FEBM1_LENGTH                 equ 0001h
PSMC3BLNK_P3FEBM1_MASK                   equ 0020h

// Register: PSMC3REBS
#define PSMC3REBS PSMC3REBS
PSMC3REBS                                equ 0858h
// bitfield definitions
PSMC3REBS_P3REBSC1_POSN                  equ 0001h
PSMC3REBS_P3REBSC1_POSITION              equ 0001h
PSMC3REBS_P3REBSC1_SIZE                  equ 0001h
PSMC3REBS_P3REBSC1_LENGTH                equ 0001h
PSMC3REBS_P3REBSC1_MASK                  equ 0002h
PSMC3REBS_P3REBSC2_POSN                  equ 0002h
PSMC3REBS_P3REBSC2_POSITION              equ 0002h
PSMC3REBS_P3REBSC2_SIZE                  equ 0001h
PSMC3REBS_P3REBSC2_LENGTH                equ 0001h
PSMC3REBS_P3REBSC2_MASK                  equ 0004h
PSMC3REBS_P3REBSC3_POSN                  equ 0003h
PSMC3REBS_P3REBSC3_POSITION              equ 0003h
PSMC3REBS_P3REBSC3_SIZE                  equ 0001h
PSMC3REBS_P3REBSC3_LENGTH                equ 0001h
PSMC3REBS_P3REBSC3_MASK                  equ 0008h
PSMC3REBS_P3REBSC4_POSN                  equ 0004h
PSMC3REBS_P3REBSC4_POSITION              equ 0004h
PSMC3REBS_P3REBSC4_SIZE                  equ 0001h
PSMC3REBS_P3REBSC4_LENGTH                equ 0001h
PSMC3REBS_P3REBSC4_MASK                  equ 0010h
PSMC3REBS_P3REBSIN_POSN                  equ 0007h
PSMC3REBS_P3REBSIN_POSITION              equ 0007h
PSMC3REBS_P3REBSIN_SIZE                  equ 0001h
PSMC3REBS_P3REBSIN_LENGTH                equ 0001h
PSMC3REBS_P3REBSIN_MASK                  equ 0080h

// Register: PSMC3FEBS
#define PSMC3FEBS PSMC3FEBS
PSMC3FEBS                                equ 0859h
// bitfield definitions
PSMC3FEBS_P3FEBSC1_POSN                  equ 0001h
PSMC3FEBS_P3FEBSC1_POSITION              equ 0001h
PSMC3FEBS_P3FEBSC1_SIZE                  equ 0001h
PSMC3FEBS_P3FEBSC1_LENGTH                equ 0001h
PSMC3FEBS_P3FEBSC1_MASK                  equ 0002h
PSMC3FEBS_P3FEBSC2_POSN                  equ 0002h
PSMC3FEBS_P3FEBSC2_POSITION              equ 0002h
PSMC3FEBS_P3FEBSC2_SIZE                  equ 0001h
PSMC3FEBS_P3FEBSC2_LENGTH                equ 0001h
PSMC3FEBS_P3FEBSC2_MASK                  equ 0004h
PSMC3FEBS_P3FEBSC3_POSN                  equ 0003h
PSMC3FEBS_P3FEBSC3_POSITION              equ 0003h
PSMC3FEBS_P3FEBSC3_SIZE                  equ 0001h
PSMC3FEBS_P3FEBSC3_LENGTH                equ 0001h
PSMC3FEBS_P3FEBSC3_MASK                  equ 0008h
PSMC3FEBS_P3FEBSC4_POSN                  equ 0004h
PSMC3FEBS_P3FEBSC4_POSITION              equ 0004h
PSMC3FEBS_P3FEBSC4_SIZE                  equ 0001h
PSMC3FEBS_P3FEBSC4_LENGTH                equ 0001h
PSMC3FEBS_P3FEBSC4_MASK                  equ 0010h
PSMC3FEBS_P3FEBSIN_POSN                  equ 0007h
PSMC3FEBS_P3FEBSIN_POSITION              equ 0007h
PSMC3FEBS_P3FEBSIN_SIZE                  equ 0001h
PSMC3FEBS_P3FEBSIN_LENGTH                equ 0001h
PSMC3FEBS_P3FEBSIN_MASK                  equ 0080h

// Register: PSMC3PHS
#define PSMC3PHS PSMC3PHS
PSMC3PHS                                 equ 085Ah
// bitfield definitions
PSMC3PHS_P3PHST_POSN                     equ 0000h
PSMC3PHS_P3PHST_POSITION                 equ 0000h
PSMC3PHS_P3PHST_SIZE                     equ 0001h
PSMC3PHS_P3PHST_LENGTH                   equ 0001h
PSMC3PHS_P3PHST_MASK                     equ 0001h
PSMC3PHS_P3PHSC1_POSN                    equ 0001h
PSMC3PHS_P3PHSC1_POSITION                equ 0001h
PSMC3PHS_P3PHSC1_SIZE                    equ 0001h
PSMC3PHS_P3PHSC1_LENGTH                  equ 0001h
PSMC3PHS_P3PHSC1_MASK                    equ 0002h
PSMC3PHS_P3PHSC2_POSN                    equ 0002h
PSMC3PHS_P3PHSC2_POSITION                equ 0002h
PSMC3PHS_P3PHSC2_SIZE                    equ 0001h
PSMC3PHS_P3PHSC2_LENGTH                  equ 0001h
PSMC3PHS_P3PHSC2_MASK                    equ 0004h
PSMC3PHS_P3PHSC3_POSN                    equ 0003h
PSMC3PHS_P3PHSC3_POSITION                equ 0003h
PSMC3PHS_P3PHSC3_SIZE                    equ 0001h
PSMC3PHS_P3PHSC3_LENGTH                  equ 0001h
PSMC3PHS_P3PHSC3_MASK                    equ 0008h
PSMC3PHS_P3PHSC4_POSN                    equ 0004h
PSMC3PHS_P3PHSC4_POSITION                equ 0004h
PSMC3PHS_P3PHSC4_SIZE                    equ 0001h
PSMC3PHS_P3PHSC4_LENGTH                  equ 0001h
PSMC3PHS_P3PHSC4_MASK                    equ 0010h
PSMC3PHS_P3PHSIN_POSN                    equ 0007h
PSMC3PHS_P3PHSIN_POSITION                equ 0007h
PSMC3PHS_P3PHSIN_SIZE                    equ 0001h
PSMC3PHS_P3PHSIN_LENGTH                  equ 0001h
PSMC3PHS_P3PHSIN_MASK                    equ 0080h

