GopalSaraf/Practicals/PSDL/include/proc/pic16f1787.inc
// Register: PSMC3DCS
#define PSMC3DCS PSMC3DCS
PSMC3DCS                                 equ 085Bh
// bitfield definitions
PSMC3DCS_P3DCST_POSN                     equ 0000h
PSMC3DCS_P3DCST_POSITION                 equ 0000h
PSMC3DCS_P3DCST_SIZE                     equ 0001h
PSMC3DCS_P3DCST_LENGTH                   equ 0001h
PSMC3DCS_P3DCST_MASK                     equ 0001h
PSMC3DCS_P3DCSC1_POSN                    equ 0001h
PSMC3DCS_P3DCSC1_POSITION                equ 0001h
PSMC3DCS_P3DCSC1_SIZE                    equ 0001h
PSMC3DCS_P3DCSC1_LENGTH                  equ 0001h
PSMC3DCS_P3DCSC1_MASK                    equ 0002h
PSMC3DCS_P3DCSC2_POSN                    equ 0002h
PSMC3DCS_P3DCSC2_POSITION                equ 0002h
PSMC3DCS_P3DCSC2_SIZE                    equ 0001h
PSMC3DCS_P3DCSC2_LENGTH                  equ 0001h
PSMC3DCS_P3DCSC2_MASK                    equ 0004h
PSMC3DCS_P3DCSC3_POSN                    equ 0003h
PSMC3DCS_P3DCSC3_POSITION                equ 0003h
PSMC3DCS_P3DCSC3_SIZE                    equ 0001h
PSMC3DCS_P3DCSC3_LENGTH                  equ 0001h
PSMC3DCS_P3DCSC3_MASK                    equ 0008h
PSMC3DCS_P3DCSC4_POSN                    equ 0004h
PSMC3DCS_P3DCSC4_POSITION                equ 0004h
PSMC3DCS_P3DCSC4_SIZE                    equ 0001h
PSMC3DCS_P3DCSC4_LENGTH                  equ 0001h
PSMC3DCS_P3DCSC4_MASK                    equ 0010h
PSMC3DCS_P3DCSIN_POSN                    equ 0007h
PSMC3DCS_P3DCSIN_POSITION                equ 0007h
PSMC3DCS_P3DCSIN_SIZE                    equ 0001h
PSMC3DCS_P3DCSIN_LENGTH                  equ 0001h
PSMC3DCS_P3DCSIN_MASK                    equ 0080h

// Register: PSMC3PRS
#define PSMC3PRS PSMC3PRS
PSMC3PRS                                 equ 085Ch
// bitfield definitions
PSMC3PRS_P3PRST_POSN                     equ 0000h
PSMC3PRS_P3PRST_POSITION                 equ 0000h
PSMC3PRS_P3PRST_SIZE                     equ 0001h
PSMC3PRS_P3PRST_LENGTH                   equ 0001h
PSMC3PRS_P3PRST_MASK                     equ 0001h
PSMC3PRS_P3PRSC1_POSN                    equ 0001h
PSMC3PRS_P3PRSC1_POSITION                equ 0001h
PSMC3PRS_P3PRSC1_SIZE                    equ 0001h
PSMC3PRS_P3PRSC1_LENGTH                  equ 0001h
PSMC3PRS_P3PRSC1_MASK                    equ 0002h
PSMC3PRS_P3PRSC2_POSN                    equ 0002h
PSMC3PRS_P3PRSC2_POSITION                equ 0002h
PSMC3PRS_P3PRSC2_SIZE                    equ 0001h
PSMC3PRS_P3PRSC2_LENGTH                  equ 0001h
PSMC3PRS_P3PRSC2_MASK                    equ 0004h
PSMC3PRS_P3PRSC3_POSN                    equ 0003h
PSMC3PRS_P3PRSC3_POSITION                equ 0003h
PSMC3PRS_P3PRSC3_SIZE                    equ 0001h
PSMC3PRS_P3PRSC3_LENGTH                  equ 0001h
PSMC3PRS_P3PRSC3_MASK                    equ 0008h
PSMC3PRS_P3PRSC4_POSN                    equ 0004h
PSMC3PRS_P3PRSC4_POSITION                equ 0004h
PSMC3PRS_P3PRSC4_SIZE                    equ 0001h
PSMC3PRS_P3PRSC4_LENGTH                  equ 0001h
PSMC3PRS_P3PRSC4_MASK                    equ 0010h
PSMC3PRS_P3PRSIN_POSN                    equ 0007h
PSMC3PRS_P3PRSIN_POSITION                equ 0007h
PSMC3PRS_P3PRSIN_SIZE                    equ 0001h
PSMC3PRS_P3PRSIN_LENGTH                  equ 0001h
PSMC3PRS_P3PRSIN_MASK                    equ 0080h

// Register: PSMC3ASDC
#define PSMC3ASDC PSMC3ASDC
PSMC3ASDC                                equ 085Dh
// bitfield definitions
PSMC3ASDC_P3ASDOV_POSN                   equ 0000h
PSMC3ASDC_P3ASDOV_POSITION               equ 0000h
PSMC3ASDC_P3ASDOV_SIZE                   equ 0001h
PSMC3ASDC_P3ASDOV_LENGTH                 equ 0001h
PSMC3ASDC_P3ASDOV_MASK                   equ 0001h
PSMC3ASDC_P3ARSEN_POSN                   equ 0005h
PSMC3ASDC_P3ARSEN_POSITION               equ 0005h
PSMC3ASDC_P3ARSEN_SIZE                   equ 0001h
PSMC3ASDC_P3ARSEN_LENGTH                 equ 0001h
PSMC3ASDC_P3ARSEN_MASK                   equ 0020h
PSMC3ASDC_P3ASDEN_POSN                   equ 0006h
PSMC3ASDC_P3ASDEN_POSITION               equ 0006h
PSMC3ASDC_P3ASDEN_SIZE                   equ 0001h
PSMC3ASDC_P3ASDEN_LENGTH                 equ 0001h
PSMC3ASDC_P3ASDEN_MASK                   equ 0040h
PSMC3ASDC_P3ASE_POSN                     equ 0007h
PSMC3ASDC_P3ASE_POSITION                 equ 0007h
PSMC3ASDC_P3ASE_SIZE                     equ 0001h
PSMC3ASDC_P3ASE_LENGTH                   equ 0001h
PSMC3ASDC_P3ASE_MASK                     equ 0080h

// Register: PSMC3ASDL
#define PSMC3ASDL PSMC3ASDL
PSMC3ASDL                                equ 085Eh
// bitfield definitions
PSMC3ASDL_P3ASDLA_POSN                   equ 0000h
PSMC3ASDL_P3ASDLA_POSITION               equ 0000h
PSMC3ASDL_P3ASDLA_SIZE                   equ 0001h
PSMC3ASDL_P3ASDLA_LENGTH                 equ 0001h
PSMC3ASDL_P3ASDLA_MASK                   equ 0001h
PSMC3ASDL_P3ASDLB_POSN                   equ 0001h
PSMC3ASDL_P3ASDLB_POSITION               equ 0001h
PSMC3ASDL_P3ASDLB_SIZE                   equ 0001h
PSMC3ASDL_P3ASDLB_LENGTH                 equ 0001h
PSMC3ASDL_P3ASDLB_MASK                   equ 0002h
PSMC3ASDL_P3ASDLC_POSN                   equ 0002h
PSMC3ASDL_P3ASDLC_POSITION               equ 0002h
PSMC3ASDL_P3ASDLC_SIZE                   equ 0001h
PSMC3ASDL_P3ASDLC_LENGTH                 equ 0001h
PSMC3ASDL_P3ASDLC_MASK                   equ 0004h
PSMC3ASDL_P3ASDLD_POSN                   equ 0003h
PSMC3ASDL_P3ASDLD_POSITION               equ 0003h
PSMC3ASDL_P3ASDLD_SIZE                   equ 0001h
PSMC3ASDL_P3ASDLD_LENGTH                 equ 0001h
PSMC3ASDL_P3ASDLD_MASK                   equ 0008h
PSMC3ASDL_P3ASDLE_POSN                   equ 0004h
PSMC3ASDL_P3ASDLE_POSITION               equ 0004h
PSMC3ASDL_P3ASDLE_SIZE                   equ 0001h
PSMC3ASDL_P3ASDLE_LENGTH                 equ 0001h
PSMC3ASDL_P3ASDLE_MASK                   equ 0010h
PSMC3ASDL_P3ASDLF_POSN                   equ 0005h
PSMC3ASDL_P3ASDLF_POSITION               equ 0005h
PSMC3ASDL_P3ASDLF_SIZE                   equ 0001h
PSMC3ASDL_P3ASDLF_LENGTH                 equ 0001h
PSMC3ASDL_P3ASDLF_MASK                   equ 0020h

// Register: PSMC3ASDS
#define PSMC3ASDS PSMC3ASDS
PSMC3ASDS                                equ 085Fh
// bitfield definitions
PSMC3ASDS_P3ASDSC1_POSN                  equ 0001h
PSMC3ASDS_P3ASDSC1_POSITION              equ 0001h
PSMC3ASDS_P3ASDSC1_SIZE                  equ 0001h
PSMC3ASDS_P3ASDSC1_LENGTH                equ 0001h
PSMC3ASDS_P3ASDSC1_MASK                  equ 0002h
PSMC3ASDS_P3ASDSC2_POSN                  equ 0002h
PSMC3ASDS_P3ASDSC2_POSITION              equ 0002h
PSMC3ASDS_P3ASDSC2_SIZE                  equ 0001h
PSMC3ASDS_P3ASDSC2_LENGTH                equ 0001h
PSMC3ASDS_P3ASDSC2_MASK                  equ 0004h
PSMC3ASDS_P3ASDSC3_POSN                  equ 0003h
PSMC3ASDS_P3ASDSC3_POSITION              equ 0003h
PSMC3ASDS_P3ASDSC3_SIZE                  equ 0001h
PSMC3ASDS_P3ASDSC3_LENGTH                equ 0001h
PSMC3ASDS_P3ASDSC3_MASK                  equ 0008h
PSMC3ASDS_P3ASDSC4_POSN                  equ 0004h
PSMC3ASDS_P3ASDSC4_POSITION              equ 0004h
PSMC3ASDS_P3ASDSC4_SIZE                  equ 0001h
PSMC3ASDS_P3ASDSC4_LENGTH                equ 0001h
PSMC3ASDS_P3ASDSC4_MASK                  equ 0010h
PSMC3ASDS_P3ASDSIN_POSN                  equ 0007h
PSMC3ASDS_P3ASDSIN_POSITION              equ 0007h
PSMC3ASDS_P3ASDSIN_SIZE                  equ 0001h
PSMC3ASDS_P3ASDSIN_LENGTH                equ 0001h
PSMC3ASDS_P3ASDSIN_MASK                  equ 0080h

// Register: PSMC3INT
#define PSMC3INT PSMC3INT
PSMC3INT                                 equ 0860h
// bitfield definitions
PSMC3INT_P3TPRIF_POSN                    equ 0000h
PSMC3INT_P3TPRIF_POSITION                equ 0000h
PSMC3INT_P3TPRIF_SIZE                    equ 0001h
PSMC3INT_P3TPRIF_LENGTH                  equ 0001h
PSMC3INT_P3TPRIF_MASK                    equ 0001h
PSMC3INT_P3TDCIF_POSN                    equ 0001h
PSMC3INT_P3TDCIF_POSITION                equ 0001h
PSMC3INT_P3TDCIF_SIZE                    equ 0001h
PSMC3INT_P3TDCIF_LENGTH                  equ 0001h
PSMC3INT_P3TDCIF_MASK                    equ 0002h
PSMC3INT_P3TPHIF_POSN                    equ 0002h
PSMC3INT_P3TPHIF_POSITION                equ 0002h
PSMC3INT_P3TPHIF_SIZE                    equ 0001h
PSMC3INT_P3TPHIF_LENGTH                  equ 0001h
PSMC3INT_P3TPHIF_MASK                    equ 0004h
PSMC3INT_P3TOVIF_POSN                    equ 0003h
PSMC3INT_P3TOVIF_POSITION                equ 0003h
PSMC3INT_P3TOVIF_SIZE                    equ 0001h
PSMC3INT_P3TOVIF_LENGTH                  equ 0001h
PSMC3INT_P3TOVIF_MASK                    equ 0008h
PSMC3INT_P3TPRIE_POSN                    equ 0004h
PSMC3INT_P3TPRIE_POSITION                equ 0004h
PSMC3INT_P3TPRIE_SIZE                    equ 0001h
PSMC3INT_P3TPRIE_LENGTH                  equ 0001h
PSMC3INT_P3TPRIE_MASK                    equ 0010h
PSMC3INT_P3TDCIE_POSN                    equ 0005h
PSMC3INT_P3TDCIE_POSITION                equ 0005h
PSMC3INT_P3TDCIE_SIZE                    equ 0001h
PSMC3INT_P3TDCIE_LENGTH                  equ 0001h
PSMC3INT_P3TDCIE_MASK                    equ 0020h
PSMC3INT_P3TPHIE_POSN                    equ 0006h
PSMC3INT_P3TPHIE_POSITION                equ 0006h
PSMC3INT_P3TPHIE_SIZE                    equ 0001h
PSMC3INT_P3TPHIE_LENGTH                  equ 0001h
PSMC3INT_P3TPHIE_MASK                    equ 0040h
PSMC3INT_P3TOVIE_POSN                    equ 0007h
PSMC3INT_P3TOVIE_POSITION                equ 0007h
PSMC3INT_P3TOVIE_SIZE                    equ 0001h
PSMC3INT_P3TOVIE_LENGTH                  equ 0001h
PSMC3INT_P3TOVIE_MASK                    equ 0080h

// Register: PSMC3PHL
#define PSMC3PHL PSMC3PHL
PSMC3PHL                                 equ 0861h
// bitfield definitions
PSMC3PHL_PSMC3PH0_POSN                   equ 0000h
PSMC3PHL_PSMC3PH0_POSITION               equ 0000h
PSMC3PHL_PSMC3PH0_SIZE                   equ 0001h
PSMC3PHL_PSMC3PH0_LENGTH                 equ 0001h
PSMC3PHL_PSMC3PH0_MASK                   equ 0001h
PSMC3PHL_PSMC3PH1_POSN                   equ 0001h
PSMC3PHL_PSMC3PH1_POSITION               equ 0001h
PSMC3PHL_PSMC3PH1_SIZE                   equ 0001h
PSMC3PHL_PSMC3PH1_LENGTH                 equ 0001h
PSMC3PHL_PSMC3PH1_MASK                   equ 0002h
PSMC3PHL_PSMC3PH2_POSN                   equ 0002h
PSMC3PHL_PSMC3PH2_POSITION               equ 0002h
PSMC3PHL_PSMC3PH2_SIZE                   equ 0001h
PSMC3PHL_PSMC3PH2_LENGTH                 equ 0001h
PSMC3PHL_PSMC3PH2_MASK                   equ 0004h
PSMC3PHL_PSMC3PH3_POSN                   equ 0003h
PSMC3PHL_PSMC3PH3_POSITION               equ 0003h
PSMC3PHL_PSMC3PH3_SIZE                   equ 0001h
PSMC3PHL_PSMC3PH3_LENGTH                 equ 0001h
PSMC3PHL_PSMC3PH3_MASK                   equ 0008h
PSMC3PHL_PSMC3PH4_POSN                   equ 0004h
PSMC3PHL_PSMC3PH4_POSITION               equ 0004h
PSMC3PHL_PSMC3PH4_SIZE                   equ 0001h
PSMC3PHL_PSMC3PH4_LENGTH                 equ 0001h
PSMC3PHL_PSMC3PH4_MASK                   equ 0010h
PSMC3PHL_PSMC3PH5_POSN                   equ 0005h
PSMC3PHL_PSMC3PH5_POSITION               equ 0005h
PSMC3PHL_PSMC3PH5_SIZE                   equ 0001h
PSMC3PHL_PSMC3PH5_LENGTH                 equ 0001h
PSMC3PHL_PSMC3PH5_MASK                   equ 0020h
PSMC3PHL_PSMC3PH6_POSN                   equ 0006h
PSMC3PHL_PSMC3PH6_POSITION               equ 0006h
PSMC3PHL_PSMC3PH6_SIZE                   equ 0001h
PSMC3PHL_PSMC3PH6_LENGTH                 equ 0001h
PSMC3PHL_PSMC3PH6_MASK                   equ 0040h
PSMC3PHL_PSMC3PH7_POSN                   equ 0007h
PSMC3PHL_PSMC3PH7_POSITION               equ 0007h
PSMC3PHL_PSMC3PH7_SIZE                   equ 0001h
PSMC3PHL_PSMC3PH7_LENGTH                 equ 0001h
PSMC3PHL_PSMC3PH7_MASK                   equ 0080h

// Register: PSMC3PHH
#define PSMC3PHH PSMC3PHH
PSMC3PHH                                 equ 0862h
// bitfield definitions
PSMC3PHH_PSMC3PH8_POSN                   equ 0000h
PSMC3PHH_PSMC3PH8_POSITION               equ 0000h
PSMC3PHH_PSMC3PH8_SIZE                   equ 0001h
PSMC3PHH_PSMC3PH8_LENGTH                 equ 0001h
PSMC3PHH_PSMC3PH8_MASK                   equ 0001h
PSMC3PHH_PSMC3PH9_POSN                   equ 0001h
PSMC3PHH_PSMC3PH9_POSITION               equ 0001h
PSMC3PHH_PSMC3PH9_SIZE                   equ 0001h
PSMC3PHH_PSMC3PH9_LENGTH                 equ 0001h
PSMC3PHH_PSMC3PH9_MASK                   equ 0002h
PSMC3PHH_PSMC3PH10_POSN                  equ 0002h
PSMC3PHH_PSMC3PH10_POSITION              equ 0002h
PSMC3PHH_PSMC3PH10_SIZE                  equ 0001h
PSMC3PHH_PSMC3PH10_LENGTH                equ 0001h
PSMC3PHH_PSMC3PH10_MASK                  equ 0004h
PSMC3PHH_PSMC3PH11_POSN                  equ 0003h
PSMC3PHH_PSMC3PH11_POSITION              equ 0003h
PSMC3PHH_PSMC3PH11_SIZE                  equ 0001h
PSMC3PHH_PSMC3PH11_LENGTH                equ 0001h
PSMC3PHH_PSMC3PH11_MASK                  equ 0008h
PSMC3PHH_PSMC3PH12_POSN                  equ 0004h
PSMC3PHH_PSMC3PH12_POSITION              equ 0004h
PSMC3PHH_PSMC3PH12_SIZE                  equ 0001h
PSMC3PHH_PSMC3PH12_LENGTH                equ 0001h
PSMC3PHH_PSMC3PH12_MASK                  equ 0010h
PSMC3PHH_PSMC3PH13_POSN                  equ 0005h
PSMC3PHH_PSMC3PH13_POSITION              equ 0005h
PSMC3PHH_PSMC3PH13_SIZE                  equ 0001h
PSMC3PHH_PSMC3PH13_LENGTH                equ 0001h
PSMC3PHH_PSMC3PH13_MASK                  equ 0020h
PSMC3PHH_PSMC3PH14_POSN                  equ 0006h
PSMC3PHH_PSMC3PH14_POSITION              equ 0006h
PSMC3PHH_PSMC3PH14_SIZE                  equ 0001h
PSMC3PHH_PSMC3PH14_LENGTH                equ 0001h
PSMC3PHH_PSMC3PH14_MASK                  equ 0040h
PSMC3PHH_PSMC3PH15_POSN                  equ 0007h
PSMC3PHH_PSMC3PH15_POSITION              equ 0007h
PSMC3PHH_PSMC3PH15_SIZE                  equ 0001h
PSMC3PHH_PSMC3PH15_LENGTH                equ 0001h
PSMC3PHH_PSMC3PH15_MASK                  equ 0080h

// Register: PSMC3DCL
#define PSMC3DCL PSMC3DCL
PSMC3DCL                                 equ 0863h
// bitfield definitions
PSMC3DCL_PSMC3DC0_POSN                   equ 0000h
PSMC3DCL_PSMC3DC0_POSITION               equ 0000h
PSMC3DCL_PSMC3DC0_SIZE                   equ 0001h
PSMC3DCL_PSMC3DC0_LENGTH                 equ 0001h
PSMC3DCL_PSMC3DC0_MASK                   equ 0001h
PSMC3DCL_PSMC3DC1_POSN                   equ 0001h
PSMC3DCL_PSMC3DC1_POSITION               equ 0001h
PSMC3DCL_PSMC3DC1_SIZE                   equ 0001h
PSMC3DCL_PSMC3DC1_LENGTH                 equ 0001h
PSMC3DCL_PSMC3DC1_MASK                   equ 0002h
PSMC3DCL_PSMC3DC2_POSN                   equ 0002h
PSMC3DCL_PSMC3DC2_POSITION               equ 0002h
PSMC3DCL_PSMC3DC2_SIZE                   equ 0001h
PSMC3DCL_PSMC3DC2_LENGTH                 equ 0001h
PSMC3DCL_PSMC3DC2_MASK                   equ 0004h
PSMC3DCL_PSMC3DC3_POSN                   equ 0003h
PSMC3DCL_PSMC3DC3_POSITION               equ 0003h
PSMC3DCL_PSMC3DC3_SIZE                   equ 0001h
PSMC3DCL_PSMC3DC3_LENGTH                 equ 0001h
PSMC3DCL_PSMC3DC3_MASK                   equ 0008h
PSMC3DCL_PSMC3DC4_POSN                   equ 0004h
PSMC3DCL_PSMC3DC4_POSITION               equ 0004h
PSMC3DCL_PSMC3DC4_SIZE                   equ 0001h
PSMC3DCL_PSMC3DC4_LENGTH                 equ 0001h
PSMC3DCL_PSMC3DC4_MASK                   equ 0010h
PSMC3DCL_PSMC3DC5_POSN                   equ 0005h
PSMC3DCL_PSMC3DC5_POSITION               equ 0005h
PSMC3DCL_PSMC3DC5_SIZE                   equ 0001h
PSMC3DCL_PSMC3DC5_LENGTH                 equ 0001h
PSMC3DCL_PSMC3DC5_MASK                   equ 0020h
PSMC3DCL_PSMC3DC6_POSN                   equ 0006h
PSMC3DCL_PSMC3DC6_POSITION               equ 0006h
PSMC3DCL_PSMC3DC6_SIZE                   equ 0001h
PSMC3DCL_PSMC3DC6_LENGTH                 equ 0001h
PSMC3DCL_PSMC3DC6_MASK                   equ 0040h
PSMC3DCL_PSMC3DC7_POSN                   equ 0007h
PSMC3DCL_PSMC3DC7_POSITION               equ 0007h
PSMC3DCL_PSMC3DC7_SIZE                   equ 0001h
PSMC3DCL_PSMC3DC7_LENGTH                 equ 0001h
PSMC3DCL_PSMC3DC7_MASK                   equ 0080h

